---
kind: method
id: M:Autodesk.Revit.Exceptions.BackgroundTaskCancelledException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/173ddf40-c234-960c-5531-81ef84c6676f.htm
---
# Autodesk.Revit.Exceptions.BackgroundTaskCancelledException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.